src/Reports/ОтчетПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ОтчетПоОхранеТруда</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезФлюрографии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьПустыеСтроки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/ПлановыеНачисленияРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеНачисленияРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчетаЗавершения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель1Завершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель2Завершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель3Завершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель4Завершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта1Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта2Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта3Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта4Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд1Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд2Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд3Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд4Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель5Завершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель6Завершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта5Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта6Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд5Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд6Завершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель1ВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель1ВВалютеЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетВОтражение</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомГруппаВОтражение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеВОтражение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчетаИзмерение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИспользуетсяВНаряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Reports/ОтчетПоОхранеТруда/Ext/ObjectModule.bsl
Перем мМакет, мНомер;
Перем ТекПодр;

#Если Клиент Тогда

Функция СформироватьЗапросПоБолееПозднейДате(Сотрудник)	
	Запрос = Новый Запрос;
	 ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛицаФлюрографии.Ссылка,
	|	ФизическиеЛицаФлюрографии.НомерСтроки,
	|	ФизическиеЛицаФлюрографии.ДатаФлюрографии КАК ДатаФлюрографии,
	|	ФизическиеЛицаФлюрографии.НомерФлюрографии,
	|	ФизическиеЛицаФлюрографии.ПоликлиникаФлюрографии,
	|	ФизическиеЛицаФлюрографии.Результат
	|ИЗ
	|	Справочник.ФизическиеЛица.Флюрографии КАК ФизическиеЛицаФлюрографии
	|ГДЕ
	|	ФизическиеЛицаФлюрографии.Ссылка = &Ссылка

	|УПОРЯДОЧИТЬ ПО
	|	ДатаФлюрографии УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	Запрос.УстановитьПараметр("ДатаНачала", НачПериод);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();	
	
	Возврат Результат;
КонецФункции

Функция СформироватьЗапросПоРаботникамВДекрете(Сотрудник)	
	Запрос = Новый Запрос;
	 ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПлановыеНачисленияРаботниковОрганизаций.Сотрудник,
	|	ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение,
	|	ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ПлановыеНачисленияРаботниковОрганизаций.Период <= &РабочаяДата
	|	И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения >= &РабочаяДата
	|	И ПлановыеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
	|	И ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты)";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("РабочаяДата", РабочаяДата);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();	
	
	Возврат Результат;
КонецФункции

	
Процедура ВывестиСтрокиПодразделения(РезультатТЗ, ДокументРезультат)
  
	Для Каждого  ВыборкаСтрокФлюрографии из РезультатТЗ Цикл 
		
		//ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокФлюрографии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		РезультаВыбораДекретниц = СформироватьЗапросПоРаботникамВДекрете(ВыборкаСтрокФлюрографии.Сотрудник).Выбрать();
		Если Не РезультаВыбораДекретниц.Следующий() Тогда
			
			
			Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокФлюрографии.ПодразделениеОрганизации Тогда			
				мНомер = 0;
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
				ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииКод);
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииНаименование;
				
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
				
				мНомер = мНомер + 1;
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка"); 
				
				ЗаполнитьЗначенияСвойств(ОбластьДетальныхЗаписей.Параметры,ВыборкаСтрокФлюрографии);
				ОбластьДетальныхЗаписей.Параметры.ДатаСмежн = Формат(ВыборкаСтрокФлюрографии.ДатаСмежн,"ДЛФ=Д");
				ОбластьДетальныхЗаписей.Параметры.мНомер = мНомер;
				ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
				ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
				ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
				

				
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
				
				ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
			Иначе
				мНомер = мНомер + 1;
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
				ОбластьДетальныхЗаписей.Параметры.мНомер = мНомер; 
				ЗаполнитьЗначенияСвойств(ОбластьДетальныхЗаписей.Параметры,ВыборкаСтрокФлюрографии);
				ОбластьДетальныхЗаписей.Параметры.ДатаСмежн = Формат(ВыборкаСтрокФлюрографии.ДатаСмежн,"ДЛФ=Д");
				ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
				ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
				ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
				
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
				
				ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
			КонецЕсли;
		КонецЕсли;
		
		//ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	ТекПодр = ""; 
	Запрос = Новый Запрос;
	
	ТекстЗапроса =
	 "ВЫБРАТЬ
	 |	РаботникиОрганизацийСрезПоследних.Организация,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник.Наименование КАК СотрудникНаименование,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК ПодразделениеОрганизацииПриоритет,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
	 |	РаботникиОрганизацийСрезПоследних.Должность КАК Должность,
	 |	NULL КАК ДатаПровЗн,
	 |	NULL КАК НомПротоколаПрЗн,
	 |	NULL КАК ПримечаниеПрЗн,
	 |	ФизическиеЛицаМедицинскийОсмотр.ДатаМедицинскогоОсмотра КАК ДатаМед,
	 |	ФизическиеЛицаМедицинскийОсмотр.ДатаСледующегоМедосмотра КАК ДатаСледМед,
	 |	ФизическиеЛицаМедицинскийОсмотр.Примечание КАК ПримечаниеМед,
	 |	NULL КАК ДатаВводный,
	 |	NULL КАК ПрофСмежн,
	 |	NULL КАК КодПрофСмежн,
	 |	NULL КАК ДатаСмежн,
	 |	NULL КАК НомПротоколаСмежн,
	 |	NULL КАК НомУдостСмежн,
	 |	NULL КАК ПримечаниеСмежн
	 |ИЗ
	 |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаОтчета, ) КАК РаботникиОрганизацийСрезПоследних
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.МедицинскийОсмотр КАК ФизическиеЛицаМедицинскийОсмотр
	 |		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФизическиеЛицаМедицинскийОсмотр.Ссылка
	 |			И (ФизическиеЛицаМедицинскийОсмотр.ДатаМедицинскогоОсмотра МЕЖДУ &ДатаНачала И &ДатаОкончания)
	 |ГДЕ
	 |	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
	 |	И РаботникиОрганизацийСрезПоследних.Организация = &Организация";
	Если ЗначениеЗаполнено(Подразделение) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";    
	КонецЕсли;
	Если ЗначениеЗаполнено(Сотрудник) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|  И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
	КонецЕсли;
	Если ИсключитьПустыеСтроки Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		
		|И ЕСТЬNULL(ФизическиеЛицаМедицинскийОсмотр.ДатаМедицинскогоОсмотра, 1) <> 1";
		
	КонецЕсли;
ТекстЗапроса = ТекстЗапроса + "

	 |
	 |СГРУППИРОВАТЬ ПО
	 |	РаботникиОрганизацийСрезПоследних.Организация,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник,
	 |	РаботникиОрганизацийСрезПоследних.Должность,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет,
	 |	ФизическиеЛицаМедицинскийОсмотр.ДатаМедицинскогоОсмотра,
	 |	ФизическиеЛицаМедицинскийОсмотр.ДатаСледующегоМедосмотра,
	 |	ФизическиеЛицаМедицинскийОсмотр.Примечание
	 |
	 |ОБЪЕДИНИТЬ
	 |
	 |ВЫБРАТЬ
	 |	РаботникиОрганизацийСрезПоследних.Организация,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.Должность,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	ФизическиеЛицаПрививки.Профессия,
	 |	ФизическиеЛицаПрививки.КодПрофессии,
	 |	ФизическиеЛицаПрививки.ДатаПрививки,
	 |	ФизическиеЛицаПрививки.НомерПротокола,
	 |	ФизическиеЛицаПрививки.НомерУдостоверения,
	 |	ФизическиеЛицаПрививки.Примечание
	 |ИЗ
	 |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаОтчета, ) КАК РаботникиОрганизацийСрезПоследних
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Прививки КАК ФизическиеЛицаПрививки
	 |		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФизическиеЛицаПрививки.Ссылка
	 |			И (ФизическиеЛицаПрививки.ДатаПрививки МЕЖДУ &ДатаНачала И &ДатаОкончания)
	 |ГДЕ
	 |	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
	 |	И РаботникиОрганизацийСрезПоследних.Организация = &Организация";
	Если ЗначениеЗаполнено(Подразделение) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";    
	КонецЕсли;
	Если ЗначениеЗаполнено(Сотрудник) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|  И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
	КонецЕсли;
	Если ИсключитьПустыеСтроки Тогда 
		ТекстЗапроса = ТекстЗапроса + "                           		
		|И ЕСТЬNULL(ФизическиеЛицаПрививки.ДатаПрививки, 1) <> 1";		
	КонецЕсли;
ТекстЗапроса = ТекстЗапроса + "

	 |
	 |СГРУППИРОВАТЬ ПО
	 |	РаботникиОрганизацийСрезПоследних.Организация,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник,
	 |	РаботникиОрганизацийСрезПоследних.Должность,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет,
	 |	ФизическиеЛицаПрививки.Профессия,
	 |	ФизическиеЛицаПрививки.КодПрофессии,
	 |	ФизическиеЛицаПрививки.ДатаПрививки,
	 |	ФизическиеЛицаПрививки.НомерПротокола,
	 |	ФизическиеЛицаПрививки.НомерУдостоверения,
	 |	ФизическиеЛицаПрививки.Примечание
	 |
	 |ОБЪЕДИНИТЬ
	 |
	 |ВЫБРАТЬ
	 |	РаботникиОрганизацийСрезПоследних.Организация,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.Должность,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL
	 |ИЗ
	 |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаОтчета, ) КАК РаботникиОрганизацийСрезПоследних
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.СанитарноГигиеническоеОбучение КАК ФизическиеЛицаСанитарноГигиеническоеОбучение
	 |		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФизическиеЛицаСанитарноГигиеническоеОбучение.Ссылка
	 |			И (ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения МЕЖДУ &ДатаНачала И &ДатаОкончания)
	 |ГДЕ
	 |	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
	 |	И РаботникиОрганизацийСрезПоследних.Организация = &Организация";
	Если ЗначениеЗаполнено(Подразделение) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";    
	КонецЕсли;
	Если ЗначениеЗаполнено(Сотрудник) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|  И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
	КонецЕсли;
	Если ИсключитьПустыеСтроки Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		
		|И ЕСТЬNULL(ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения, 1) <> 1";
		
	КонецЕсли;
ТекстЗапроса = ТекстЗапроса + "

	 |
	 |СГРУППИРОВАТЬ ПО
	 |	РаботникиОрганизацийСрезПоследних.Организация,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник,
	 |	РаботникиОрганизацийСрезПоследних.Должность,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет,
	 |	ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения
	 |
	 |ОБЪЕДИНИТЬ
	 |
	 |ВЫБРАТЬ
	 |	РаботникиОрганизацийСрезПоследних.Организация,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.Должность,
	 |	ФизическиеЛицаФлюрографии.ДатаФлюрографии,
	 |	ФизическиеЛицаФлюрографии.НомерФлюрографии,
	 |	ФизическиеЛицаФлюрографии.Примечание,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL
	 |ИЗ
	 |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаОтчета, ) КАК РаботникиОрганизацийСрезПоследних
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Флюрографии КАК ФизическиеЛицаФлюрографии
	 |		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФизическиеЛицаФлюрографии.Ссылка
	 |			И (ФизическиеЛицаФлюрографии.ДатаФлюрографии МЕЖДУ &ДатаНачала И &ДатаОкончания)
	 |ГДЕ
	 |	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
	 |	И РаботникиОрганизацийСрезПоследних.Организация = &Организация";
	Если ЗначениеЗаполнено(Подразделение) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";    
	КонецЕсли;
	Если ЗначениеЗаполнено(Сотрудник) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|  И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
	КонецЕсли;
	Если ИсключитьПустыеСтроки Тогда 
		ТекстЗапроса = ТекстЗапроса + "                                 		
		|И ЕСТЬNULL(ФизическиеЛицаФлюрографии.ДатаФлюрографии, 1) <> 1";		
	КонецЕсли;
ТекстЗапроса = ТекстЗапроса + "

	 |
	 |СГРУППИРОВАТЬ ПО
	 |	РаботникиОрганизацийСрезПоследних.Организация,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник,
	 |	РаботникиОрганизацийСрезПоследних.Должность,
	 |	РаботникиОрганизацийСрезПоследних.Сотрудник.Наименование,
	 |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет,
	 |	ФизическиеЛицаФлюрографии.ДатаФлюрографии,
	 |	ФизическиеЛицаФлюрографии.НомерФлюрографии,
	 |	ФизическиеЛицаФлюрографии.Примечание
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ПодразделениеОрганизацииПриоритет,
	 |	ПодразделениеОрганизацииНаименование,
	 |	СотрудникНаименование,
	 |	Должность";
	
		
	Запрос.УстановитьПараметр("ДатаНачала",НачПериод);
	Запрос.УстановитьПараметр("ДатаОкончания",КонПериод);
	Запрос.УстановитьПараметр("ДатаОтчета",РабочаяДата);
	Запрос.УстановитьПараметр("Подразделение",      Подразделение);
	Запрос.УстановитьПараметр("Организация",      Организация);
	Запрос.УстановитьПараметр("Сотрудник",      Сотрудник);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить().Выгрузить();
	ТЗТаблица = Новый ТаблицаЗначений;
	ТЗТаблица.Колонки.Добавить("Организация");
	ТЗТаблица.Колонки.Добавить("Сотрудник");
	ТЗТаблица.Колонки.Добавить("ПодразделениеОрганизации");
	ТЗТаблица.Колонки.Добавить("ПодразделениеОрганизацииКод");
	ТЗТаблица.Колонки.Добавить("ПодразделениеОрганизацииПриоритет");
	ТЗТаблица.Колонки.Добавить("ПодразделениеОрганизацииНаименование");
	ТЗТаблица.Колонки.Добавить("Должность");
	ТЗТаблица.Колонки.Добавить("ДатаПровЗн");
	ТЗТаблица.Колонки.Добавить("НомПротоколаПрЗн");
	ТЗТаблица.Колонки.Добавить("ПримечаниеПрЗн");
	ТЗТаблица.Колонки.Добавить("ДатаМед");
	ТЗТаблица.Колонки.Добавить("ДатаСледМед");
	ТЗТаблица.Колонки.Добавить("ПримечаниеМед");
	ТЗТаблица.Колонки.Добавить("ДатаВводный");
	ТЗТаблица.Колонки.Добавить("ПрофСмежн");
	ТЗТаблица.Колонки.Добавить("КодПрофСмежн");
	ТЗТаблица.Колонки.Добавить("ДатаСмежн");
	ТЗТаблица.Колонки.Добавить("НомПротоколаСмежн");
	ТЗТаблица.Колонки.Добавить("НомУдостСмежн");
	ТЗТаблица.Колонки.Добавить("ПримечаниеСмежн");
	
	Для Каждого стр из Результат Цикл 
		
		МассивТаблица = ТЗТаблица.НайтиСтроки(Новый Структура("Сотрудник",стр.Сотрудник));
		Если МассивТаблица.Количество()=0 Тогда 
			стрТЗТаблица = ТЗТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(стрТЗТаблица,стр);
			
		иначе
			 
			Если ЗначениеЗаполнено(стр.ДатаПровЗн) Тогда 
				СтрокаЕсть = Ложь;
				Для Каждого стрЗн из МассивТаблица Цикл 
					Если стрЗн.ДатаПровЗн = Null Тогда 
						стрЗн.ДатаПровЗн = стр.ДатаПровЗн;
						стрЗн.НомПротоколаПрЗн = стр.НомПротоколаПрЗн;
						стрЗн.ПримечаниеПрЗн = стр.ПримечаниеПрЗн;
						СтрокаЕсть = Истина;
						Прервать;
					КонецЕсли;
					
					
				КонецЦикла;
				Если не СтрокаЕсть Тогда 
					стрТЗТаблица = ТЗТаблица.Добавить();
					ЗаполнитьЗначенияСвойств(стрТЗТаблица,стр);
					
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(стр.ДатаМед) Тогда 
				СтрокаЕсть = Ложь;
				Для Каждого стрЗн из МассивТаблица Цикл 
					Если стрЗн.ДатаМед = Null Тогда 
						стрЗн.ДатаМед = стр.ДатаМед;
						стрЗн.ДатаСледМед = стр.ДатаСледМед;
						стрЗн.ПримечаниеМед = стр.ПримечаниеМед;
						СтрокаЕсть = Истина;
						Прервать;
					КонецЕсли;
					
				КонецЦикла; 
				Если не СтрокаЕсть Тогда 
					стрТЗТаблица = ТЗТаблица.Добавить();
					ЗаполнитьЗначенияСвойств(стрТЗТаблица,стр);
					
				КонецЕсли;

			ИначеЕсли ЗначениеЗаполнено(стр.ДатаВводный) Тогда 
				СтрокаЕсть = Ложь;
				Для Каждого стрЗн из МассивТаблица Цикл 
					Если стрЗн.ДатаВводный = Null Тогда 
						стрЗн.ДатаВводный = стр.ДатаВводный;
						СтрокаЕсть = Истина;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				Если не СтрокаЕсть Тогда 
					стрТЗТаблица = ТЗТаблица.Добавить();
					ЗаполнитьЗначенияСвойств(стрТЗТаблица,стр);
					
				КонецЕсли;


			ИначеЕсли ЗначениеЗаполнено(стр.ДатаСмежн) Тогда 
				СтрокаЕсть = Ложь;
				Для Каждого стрЗн из МассивТаблица Цикл 
					Если стрЗн.ДатаСмежн = Null Тогда 
						стрЗн.ДатаСмежн = стр.ДатаСмежн;
						стрЗн.ПрофСмежн = стр.ПрофСмежн;
						стрЗн.КодПрофСмежн = стр.КодПрофСмежн;
						стрЗн.НомПротоколаСмежн = стр.НомПротоколаСмежн;
						стрЗн.НомУдостСмежн = стр.НомУдостСмежн;
						стрЗн.ПримечаниеСмежн = стр.ПримечаниеСмежн;
						СтрокаЕсть = Истина;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				Если не СтрокаЕсть Тогда 
					стрТЗТаблица = ТЗТаблица.Добавить();
					ЗаполнитьЗначенияСвойств(стрТЗТаблица,стр);
					
				КонецЕсли;


			КонецЕсли;
			
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	
	
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(КонПериод), "ДФ=""ММММ.гггг""");
	Область.Параметры.Подразделение = ?(ЗначениеЗаполнено(Подразделение), СокрЛП(Подразделение.Наименование), "");
	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	//ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ТЗТаблица, ДокументРезультат);
	
КонецПроцедуры

мМакет = ПолучитьМакет("МакетФлюрография");
#КонецЕсли
